documentation/glint/Glint.docset/Contents/Resources/Documents/dynamic_arrays.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-08 Sun 13:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Rylan Kellogg" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="all.css">
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgd8a7aed" class="outline-2">
<h2 id="orgd8a7aed"><span class="section-number-2">1.</span> Glint's Built-in Dynamic Array Type</h2>
<div class="outline-text-2" id="text-1">
<p>
Glint's dynamic array type allows the Glint programmer to have a collection of some other type, contiguous in memory, without worrying <i>too much</i> about where that memory comes from or goes to.
</p>

<p>
If you are familiar with C++, think <code>std::vector&lt;T&gt;</code>.
</p>

<p>
If you are familiar with Rust, think <code>Vec</code>;
</p>

<p>
If you are familiar with any LISP, think, well, <code>()</code> <code>:^)</code>.
</p>
</div>
<div id="outline-container-org7c3ce5d" class="outline-3">
<h3 id="org7c3ce5d"><span class="section-number-3">1.1.</span> Initialisation</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; Define a dynamic array with elements of type `T`.</span>
array <span class="org-operator">:</span> <span class="org-type">[T]</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; Define a dynamic array with elements of type `T`, able to hold at least</span>
<span class="org-comment">;; `N` elements.</span>
<span class="org-comment">;; If `N` is not a variable, this will create a *fixed* array.</span>
N <span class="org-operator">::</span> <span class="org-number">8</span>;
array <span class="org-operator">:</span> <span class="org-type">[T N]</span>;
</pre>
</div>
</div>
<div id="outline-container-org5de6043" class="outline-4">
<h4 id="org5de6043"><span class="section-number-4">1.1.1.</span> Non-standard (non-zeroed) default initialisation</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Normally, when any other type is default-initialised in Glint, it is zeroed out. All bytes that constitute the value of that type are set to the zero value (no bits set).
</p>

<p>
Dynamic arrays are different: memory is allocated, and a pointer to that memory is stored in the dynamic array (accessible at <code>array.data</code>, <code>array[index]</code>). The capacity of that memory is also stored in the dynamic array (accessible at <code>array.capacity</code>).
</p>
</div>
</div>
<div id="outline-container-orgd0e650c" class="outline-4">
<h4 id="orgd0e650c"><span class="section-number-4">1.1.2.</span> From Other Types</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org93505c7"></a>From Fixed Array<br /></li>

<li><a id="org51ee26c"></a>From Array View<br /></li>

<li><a id="orgf1b1136"></a>From Pointer and Size<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orged4079b" class="outline-3">
<h3 id="orged4079b"><span class="section-number-3">1.2.</span> Modification</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf7bbe5e" class="outline-4">
<h4 id="orgf7bbe5e"><span class="section-number-4">1.2.1.</span> Prepend/Append</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; Append</span>
array[index] <span class="org-operator">+=</span> element; <span class="org-comment">;; @array[array.size] is now element</span>
<span class="org-comment">;; Prepend</span>
array[index] <span class="org-operator">~=</span> element; <span class="org-comment">;; @array[0] is now element</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4e01a8" class="outline-4">
<h4 id="orgb4e01a8"><span class="section-number-4">1.2.2.</span> Insert At Index</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-glint"><span class="org-comment">;; Insert</span>
array[index] <span class="org-operator">+=</span> element;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2ba6251" class="outline-3">
<h3 id="org2ba6251"><span class="section-number-3">1.3.</span> Delete Requirement</h3>
<div class="outline-text-3" id="text-1-3">
<p>
It is a program error to initialise a dynamic array without subsequently using the unary negation operator on it, i.e. <code>-array</code>. You should do this from the same scope you defined the dynamic array in.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
